--[[

custom_tool 0.1.0 2018-04-28

------------------------------------------------------------------------------------------------------------------ 
描述:
  放置自己寫的函數工具。

------------------------------------------------------------------------------------------------------------------
變量解釋:
--------
  函數:
  - pairs_by_keys           - function
    table遍歷函數。

------------------------------------------------------------------------------------------------------------------
開發日誌:
  Unreleased - 2018-04-28 - 啟動專案
    Added:
    - 新增新的遍歷函數。

]]
local custom_tool = {}
local table = table

function pairs_by_keys(t)
  local o = {}
  for n in pairs(t) do 
    o[#o+1] = n 
  end 
  table.sort(o)
  local i = 0
  return function()
    i = i + 1
    print(i)
    return o[i], t[o[i]]
  end
end 

return custom_tool