ATTRIBUTE = {'物理攻擊力', '法術攻擊力', '物理護甲', '法術護甲', '元素傷害', '命中', '閃避', '技巧', '感知', '耐力', '精神',
'急速', '精通', '幸運', '靈敏', '物理穿透', '法術穿透', '物理韌性', '法術韌性', '物理格擋', '法術格擋', '物理暴擊率', '法術暴擊率',
'攻擊速度', '施法速度', '固定物理傷害', '固定法術傷害', '額外物理傷害', '額外法術傷害', '特殊物理傷害', '特殊法術傷害', '元素傷害%',
'額外物理護甲', '額外法術護甲', '特殊物理護甲', '特殊法術護甲', '物理護甲%', '法術護甲%', '近戰減傷', '遠程減傷', '傷害擴散', '減少魔力消耗',
'普通增傷', '菁英增傷', '稀有菁英增傷', '頭目增傷', '普通減傷', '菁英減傷', '稀有菁英減傷', '頭目減傷', '對普通降傷', '對菁英降傷',
'對稀有菁英降傷', '對頭目降傷', '無元素增傷', '地元素增傷', '水元素增傷', '火元素增傷', '風元素增傷', '龍族增傷', '元素增傷', '靈魂增傷',
'動物增傷', '人形增傷', '人造增傷', '惡魔增傷', '龍族減傷', '元素減傷', '靈魂減傷', '動物減傷', '人形減傷', '人造減傷', '惡魔減傷',
'對龍族降傷', '對元素降傷', '對靈魂降傷', '對動物降傷', '對人形降傷', '對人造降傷', '對惡魔降傷', '生命恢復', '魔力恢復', '移動速度'}

ATTRIBUTE_INDEX = {}
for i, v in ipairs(ATTRIBUTE) do 
    ATTRIBUTE_INDEX[v] = i
end

ATTRIBUTE_STATE = {
    ["精神"] = "+N 精神",
    ["精通"] = "+N 精通",
}

ATTRIBUTE_SCORE = {
    ["精神"] = 1,
    ["精通"] = 1,
}
return ATTRIBUTE, ATTRIBUTE_INDEX, ATTRIBUTE_STATE, ATTRIBUTE_SCORE